#include <stdio.h>

/**
 * 综合练习-5-1
 * 输出: 16 20
 */
void main()
{
    int a[8];
    int s1 = 0, s2 = 0, *p;
    printf("请输入8个整数:");
    for (p = a; p < a + 8; p++)
    //输入：1 2 3 4 5 6 7 8
        scanf("%d", p);
    for (p = a; p < a + 8; p++)
    {  
        if (*p % 2)
            s1 += *p;
        //1 ==> s1=0+1=1
        //3 ==> s1=1+3=4
        //5 ==> s1=4+5=9
        //7 ==> s1=9+7=16
        else
            s2 += *p;
        //2 ==> s2=0+2=2
        //4 ==> s2=2+4=6
        //6 ==> s2=6+6=12
        //8 ==> s2=12+8=20
    }
    //输出: 16 20
    printf("%d %d\n", s1, s2);
}